# -*- coding: utf-8 -*-
# Напишите программу, которая считывает три числа и выводит их сумму. Каждое число записано в отдельной строке.

print("Введите 3 числа:")
a = int(input())
b = int(input())
c = int(input())

s = a+b+c

print(s)